КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СтатусДокументаТребуетПроверки(Статус) Экспорт
	
	Возврат ПолучитьМассивСтатусовНеТребующихПроверки().Найти(Статус) = Неопределено; 
	
КонецФункции

Функция ПолучитьМассивСтатусовНеТребующихПроверки()
	
	Результат = ПолучитьМассивСтатусовВходящегоДокумента();
	Результат.Добавить(РаботаЗавершена);
	Результат.Добавить(РаботаЗавершенаРаспечатан);
	
	Возврат Результат
	
КонецФункции	

Функция ПолучитьМассивСтатусовВходящегоДокумента()
	
	Результат = Новый Массив;
	Результат.Добавить(Получен);
	Результат.Добавить(ПолученТребуетОбработки);
	Результат.Добавить(ПолученОбработанСПредупреждением);
	
	Возврат Результат

КонецФункции	

#КонецЕсли
